SunCity/src/Catalogs/МобильныеПриложения/МобильныеПриложения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>МобильныеПриложения</name>
  <attributes>
    <name>ВариантНастройки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияПриложения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КраткаяИнформация</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СайтПриложения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Разработчик</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СайтРазработчика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПриложенияGoogle</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПриложенияApple</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПриложенияWindows</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

SunCity/src/Catalogs/МобильныеПриложения/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	Заголовок = Объект.Наименование;
	
	Превью = УправлениеМобильнымиПриложениями.ПревьюПриложения(Объект.Ссылка, УникальныйИдентификатор);
	
	СкачатьGooglePlay = УправлениеМобильнымиПриложениями.ПолучитьСсылкуНаСкачивание(
		Объект.Ссылка, УникальныйИдентификатор);
	Элементы.ГруппаСкачать.Видимость = Не ПустаяСтрока(СкачатьGooglePlay);
	
	Описание = УправлениеМобильнымиПриложениями.ПолучитьОписаниеПриложения(Объект.Ссылка);
	Элементы.Разработчик.Гиперссылка = Не ПустаяСтрока(Объект.СайтРазработчика);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НадписьПерейтиКНастройкамНажатие(Элемент)
	
	
	ИмяФормыНастроек = "ПланОбмена.ОбменСМобильнымиПриложениями.Форма.ФормаСписка";
	НеобходимПереходПоСсылке = Ложь;
	УправлениеМобильнымиПриложениямиКлиентСерверПереопределяемый.ПриОпределенииФормыНастроекПриложения(
		Объект.ВариантНастройки, ИмяФормыНастроек, НеобходимПереходПоСсылке);
	
	Если НеобходимПереходПоСсылке Тогда
		ПерейтиПоНавигационнойСсылке(ИмяФормыНастроек);
	Иначе
		ОткрытьФорму(ИмяФормыНастроек);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РазработчикНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если ЗначениеЗаполнено(Объект.СайтРазработчика) Тогда
		ПерейтиПоНавигационнойСсылке(Объект.СайтРазработчика);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
